Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServer.CreateEngineeringGeolocation(Autodesk.Revit.DB.Geolocation.Services.EngineeringGeolocationData)
Create and fill in an EngineeringGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServer.CreateDerivedGeolocation(Autodesk.Revit.DB.Geolocation.Services.DerivedGeolocationData)
Create and fill in an AdvancedGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServer.CreateBasicGeolocation(Autodesk.Revit.DB.Geolocation.Services.BasicGeolocationData)
Create and fill in a BasicGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServer.CreateAdvancedGeolocation(Autodesk.Revit.DB.Geolocation.Services.AdvancedGeolocationData)
Create and fill in an AdvancedGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServer
Interface class for external server implementing creation of geolocations.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.